# PrimaryHandrailHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..PrimaryHandrailHeight Property
RailingType Class See Also
---
The height of the primary handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double PrimaryHandrailHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PrimaryHandrailHeight As Double
	Get
```

Visual C++
---
```text
public:
property double PrimaryHandrailHeight {
	double get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The rail has no primary hand rail. |

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace